Readme.org
#+TITLE: Humacs (emacs for humans!)
* Humacs

** Install

Can be to pretty much anywhere

#+begin_src shell
git clone --recursive https://github.com/humacs/humacs
cd humacs
./install.sh
#+end_src

** resulting symlinks

#+NAME: resulting symlinks
#+begin_src shell
ls -laF ~/ | grep humacs | awk '{print $9, $10, $11}'
#+end_src

#+RESULTS: resulting symlinks
#+begin_example
.emacs@ -> /Users/hh/humacs/chemacs/.emacs
.emacs-profile@ -> /Users/hh/humacs/.emacs-profile
.emacs-profiles.el@ -> /Users/hh/humacs/.emacs-profiles.el
humacs/
#+end_example



#+RESULTS:
#+begin_example
lrwxr-xr-x    1 hh    staff        31 28 Jul 09:50 .emacs@ -> /Users/hh/humacs/chemacs/.emacs
lrwxr-xr-x    1 hh    staff        31 28 Jul 10:58 .emacs-profile@ -> /Users/hh/humacs/.emacs-profile
lrwxr-xr-x    1 hh    staff        35 28 Jul 10:58 .emacs-profiles.el@ -> /Users/hh/humacs/.emacs-profiles.el
drwxr-xr-x   14 hh    staff       448 28 Jul 12:16 humacs/
#+end_example
